In [127]:
import pandas as pd

# Load all sheets as a dictionary of DataFrames
all_dfs = pd.read_excel("reg_data_final.xlsx", sheet_name=None)

In [128]:

from pathlib import Path


# Output directory
out_dir = Path("csv_outputs")
out_dir.mkdir(exist_ok=True)

processed_dfs = {}

for sheet_name, df in all_dfs.items():
    df = df.copy()

    # Extract column names from row 6
    column_names = df.iloc[6].values
    df.columns = column_names

    # Drop header/meta rows and reset index
    df = df.iloc[8:].reset_index(drop=True)

    # Save as CSV
    csv_path = out_dir / f"{sheet_name}.csv"
    df.to_csv(csv_path, index=False)

    # Keep reference if needed later
    processed_dfs[sheet_name] = df

In [129]:
pd.set_option("display.max_columns", None)
pd.set_option("display.width", 180)
pd.set_option("display.max_colwidth", None)

In [130]:
for sheet_name, df in processed_dfs.items():
    print(f"=== Sheet: {sheet_name} ===")
    try:
        from IPython.display import display
        display(df.describe())
    except Exception:
        print(df.describe())
    print()

=== Sheet: dip 1st ===

        SN                                     Name of Institute Institute Type Diploma/PCL Program Quota  Applicant Pre-diploma Program Quota  Applicant
count   37                                                    35             35                  72    72         74                   0     0          2
unique  37                                                    35              4                  21     6         26                   0     0          1
top      1  AALAMDEVI BAHUPRABIDHIK SHIKSHYALAYA, MIRMI, SYANGJA        Private    General Medicine   -40         40                 NaN   NaN          0
freq     1                                                     1             16                  12    43         20                 NaN   NaN          2

=== Sheet: dip 2nd ===

        SN                                     Name of Institute Institute Type Diploma/PCL Program Quota  Applicant Pre-diploma Program Quota  Applicant
count   42                                                    40             40                  76    76         78                   0     0          2
unique  42                                                    40              4                  19     6         32                   0     0          1
top      1  AALAMDEVI BAHUPRABIDHIK SHIKSHYALAYA, MIRMI, SYANGJA        Private    General Medicine   -40         40                 NaN   NaN          0
freq     1                                                     1             17                  12    45         19                 NaN   NaN          2

=== Sheet: dip 3rd ===

        SN                                     Name of Institute Institute Type Diploma/PCL Program Quota  Applicant Pre-diploma Program Quota  Applicant
count   56                                                    54             54                  85    85         87                   0     0          2
unique  56                                                    54              4                  19     3         33                   0     0          1
top      1  AALAMDEVI BAHUPRABIDHIK SHIKSHYALAYA, MIRMI, SYANGJA           TECS   Civil Engineering   -40         40                 NaN   NaN          0
freq     1                                                     1             21                  17    45         15                 NaN   NaN          2

=== Sheet: pre 2081 ===

        SN                            Name of Institute Institute Type Diploma/PCL Program  Quota  Applicant        Pre-diploma Program  Quota  Applicant
count   33                                           31             31                   0      0          2                         40     40         42
unique  33                                           31              4                   0      0          1                         15      3         26
top      1  ANANDAJYOTI SECONDARY SCHOOL, BEGNAS, KASKI           TECS                 NaN    NaN          0  Agriculture/Plant Science    -40         20
freq     1                                            1             22                 NaN    NaN          2                         12     33          4

=== Sheet: pre 2082 ===

        SN                            Name of Institute Institute Type Diploma/PCL Program  Quota  Applicant        Pre-diploma Program  Quota  Applicant
count   33                                           31             31                   0      0          2                         37     37         39
unique  33                                           31              4                   0      0          1                         13      4         24
top      1  ANANDAJYOTI SECONDARY SCHOOL, BEGNAS, KASKI           TECS                 NaN    NaN          0  Agriculture/Plant Science    -40         20
freq     1                                            1             23                 NaN    NaN          2                         11     29          8

In [ ]:
for sheet_name, df in processed_dfs.items():
    df.dropna(inplace=True, thresh=df.shape[0] / 2, axis=1)
    df['Quota'] = pd.to_numeric(df['Quota'], errors='coerce').abs()
    df['Applicant'] = pd.to_numeric(df['Applicant'], errors='coerce')
    
    
    while True:
        last = df.iloc[-1, 0]
        if last in ('Grand Total', 'Total'):
            print(True)
            df = df.iloc[:-1]
        else:
            break

    
    # merging for nan
    df.iloc[:, 1] = (
    df.iloc[:, 1]
      .ffill()
      .infer_objects(copy=False)
    )
    
    df.iloc[:, 2] = df.iloc[:, 2].ffill().infer_objects(copy=False)
    
    df.iloc[:, 0] = df.iloc[:, 0].ffill().infer_objects(copy=False)
    df = df.sort_values(by=df.columns[2])
    
    processed_dfs[sheet_name] = df

True
True
True
True
True
True
True
True
True
True

/tmp/ipykernel_23409/3416032814.py:26: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.iloc[:, 0] = df.iloc[:, 0].ffill().infer_objects(copy=False)
/tmp/ipykernel_23409/3416032814.py:26: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.iloc[:, 0] = df.iloc[:, 0].ffill().infer_objects(copy=False)
/tmp/ipykernel_23409/3416032814.py:26: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.iloc[:, 0] = df.iloc[:, 0].ffill().infer_objects(copy=False)
/tmp/ipykernel_23409/3416032814.py:26: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.iloc[:, 0] = df.iloc[:, 0].ffill().infer_objects(copy=False)
/tmp/ipykernel_23409/3416032814.py:26: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.iloc[:, 0] = df.iloc[:, 0].ffill().infer_objects(copy=False)

In [73]:
for sheet_name, df in processed_dfs.items():
    csv_path = out_dir / f"{sheet_name}.csv"
    df.to_csv(csv_path, index=False)

In [120]:
import pandas as pd

# Load all sheets as a dictionary of DataFrames
raw_dfs = pd.read_excel("diploma_year_stats.xlsx", sheet_name=None)

In [116]:
df = raw_dfs['2081']
df = df.iloc[6:].dropna(how='all', axis=0).reset_index(drop=True)

In [123]:

all_dfs = []
prev = 0
prev_name = ""
for row in df.iterrows():
    name = row[1].values[0]
    
    if type(name) != str:
        continue
    
    if "Program:" in name:
        name = name.replace("Program:", "").strip()
        curr = int(row[0])        
        if prev_name != "":
            section_df = df.iloc[prev+1:curr].reset_index(drop=True)
            col_names = ["S.N", "Institute Name", "District", "Approved"]   #"Quota"
            section_df.columns = col_names
            section_df["Program"] = prev_name
            all_dfs.append(section_df.iloc[2:-1].reset_index(drop=True))
        
        prev_name = name
        prev = curr

In [124]:
df_2081 = pd.concat(all_dfs).reset_index(drop=True)